app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 30 Apr 2013 11:25:58 UTC +00:00], ["updated_at", Tue, 30 Apr 2013 11:25:58 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 2], ["created_at", Sun, 02 Jun 2013 12:41:46 UTC +00:00], ["order_id", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Sun, 02 Jun 2013 12:41:46 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 4, "updated_at" = '2013-04-30 11:58:34.134148' WHERE "line_items"."id" = 11
---
    def create
        @cart = current_cart
        product = Product.find(params[:product_id])
        @line_item = @cart.add_product(product.id)
        @line_item.product = product

        respond_to do |format|
            if @line_item.save